const eventsData = {
  "2025-10-31": [{ time: "", title: "영업 활동", tags: ["염"] }],
  "2025-11-03": [
    { time: "", title: "EG-BIM V1.2.0 업데이트 문의 대응", tags: ["김"] },
    {
      time: "",
      title:
        "외부사용자 업데이트 안내 ( 개인설정 저장 )<br><em>※ 메일전송 후 유선안내</em>",
      tags: ["김"],
    },
  ],
  "2025-11-04": [
    { time: "", title: "더부엔지니어링", tags: ["염"] },
    { time: "", title: "선인이엔지", tags: ["염"] },
    { time: "", title: "제이알조경 ID&PW 생성(4)", tags: ["김"] },
  ],
  "2025-11-05": [
    {
      time: "12:00~14:00",
      title: "연세대 ( 한맥 구조부 부서장님 연계교 )",
      tags: ["염"],
    },
    { time: "15:00~16:00", title: "대림대 ( 이진형교수 )", tags: ["염"] },
    {
      time: "16:00~18:00",
      title: "한길아이티 ( 계약헙의 및 EG-BIM 소개 )",
      tags: ["권"],
    },
    { time: "", title: "안양, 과천, 방문업체 선정", tags: ["권"] },
    { time: "", title: "캐드제품군 가격정보 최신화", tags: ["권"] },
    {
      time: "",
      title: "가족사 부서별 CAD 프로그램 사용현황 파악",
      tags: ["김"],
    },
  ],
  "2025-11-06": [
    { time: "09:00~10:00", title: "피컴스엔지니어링", tags: ["염"] },
    {
      time: "11:00~12:00",
      title: "영업대시보드 회의",
      tags: ["권", "염", "김"],
    },
    {
      time: "",
      title:
        "삼안 CM현장 방문협의 : 통복공공하수처리시설( KG, 갑인, 세일 : 9명 미팅가능)",
      tags: ["권"],
    },
  ],
  "2025-11-07": [
    {
      time: "14:00~15:00",
      title: "- 마이다스아이티 계약협의 (거여동)",
      tags: ["권", "염"],
    },
    { time: "", title: "삼안 & 한맥 CM현장 방문협의", tags: ["권"] },
    {
      time: "",
      title: "구조기술사회 팝업사항 진도사항 점검",
      tags: ["염"],
    },
    { time: "", title: "인하공전 교수님 연락처 확인", tags: ["염"] },
  ],
  "2025-11-10": [
    {
      time: "10:00~12:00",
      title: "큰길 개발자 최종리뷰",
      tags: ["권", "염"],
    },
    { time: "15:00~16:00", title: "사장님 영업보고", tags: ["권", "염"] },
    { time: "17:00~18:00", title: "영업대시보드 회의", tags: ["염"] },
  ],
  "2025-11-11": [
    {
      time: "10:30~11:30",
      title:
        "삼안 CM현장 : 통복공공하수처리시설, 평택 홍만기단장(공동도급관련 5개사)",
      tags: ["권", "염"],
    },
    {
      time: "13:00~14:00",
      title:
        "공단배수지 추가 증설공사 등 7개소 통합건설사업관리단 ( 동명기술공단 외 )김민관단장",
      tags: ["권", "염"],
    },
    { time: "15:00~16:00", title: "서림주택관리", tags: ["권"] },
    { time: "", title: "영업대시보드 기획", tags: ["김"] },
    { time: "", title: "DREAM PLUS", tags: ["김"] },
  ],
  "2025-11-12": [
    { time: "13:00~14:00", title: "대전대 유병재 교수", tags: ["염"] },
    { time: "15:00~16:00", title: "우송대 안태봉교수", tags: ["염"] },
    { time: "17:00~18:00", title: "CIVIL EXPO 준비참석", tags: ["염"] },
    {
      time: "17:00~18:00",
      title: "한국종합엔지니어링 기획팀 방문",
      tags: ["권"],
    },
    { time: "", title: "원건설(청주): 오전", tags: ["권"] },
  ],
  "2025-11-13": [
    {
      time: "14:00~15:00",
      title: "나모소프트 ( 연구소 팀장, 유선협의)",
      tags: ["권"],
    },
    { time: "", title: "업무지원 ( 장헌산업, 당진공장 )", tags: ["권"] },
    { time: "", title: "CIVIL EXPO 참석", tags: ["염"] },
    {
      time: "",
      title: "영업 대시보드 기획 (9,10월 영업내역 전달)",
      tags: ["김"],
    },
  ],
  "2025-11-14": [
    {
      time: "10:00~11:00",
      title: "피컴스, 오토데스크 이슈 컨설팅 미팅",
      tags: ["권"],
    },
    { time: "", title: "CIVIL EXPO 참석", tags: ["염"] },
    {
      time: "",
      title: "각 부서 주사용 DREAM PLUS 명령어 취합",
      tags: ["김"],
    },
  ],
  "2025-11-17": [
    {
      time: "",
      title: "의왕도시공사 ( MOU 초안 작성 )",
      tags: ["권", "염"],
    },
    {
      time: "",
      title: " 한라대학교 ( 강의커리큐럼 초안 작성 )",
      tags: ["권", "염"],
    },
    { time: "", title: "인하공전 특강준비", tags: ["염"] },
    { time: "", title: "영업대시보드 DB 정리", tags: ["김"] },
  ],
  "2025-11-18": [
    { time: "13:30", title: "인하대 김수전교수", tags: ["염"] },
    {
      time: "14:00~15:00",
      title:
        "[ Smart Construction x OSC x SCCI ]( 오토데스크, 도로공사, 대한 경제, 정보수집 외)",
      tags: ["권"],
    },
    { time: "17:00~18:00", title: "인하대 남진원교수", tags: ["권"] },
    { time: "", title: "인천시청", tags: ["염"] },
    {
      time: "",
      title: "회원관리시스템 flow작성(EG-BIM / KNGIL)",
      tags: ["김"],
    },
  ],
  "2025-11-19": [
    {
      time: "11:00~12:00",
      title:
        "해린엔지니어링 토목사업부 및 도시계획부 ( 청주 : 배창근 이사님,이동현 이사님) 청주시 청원구 1순환로 1896번길 20",
      tags: ["권", "염"],
    },
    {
      time: "13:00~14:00",
      title:
        "홍익기술단 안전진단부 방문협의(청주) 청주시 흥덕구 풍년로 150번길 28",
      tags: ["권"],
    },
    {
      time: "13:00~14:00",
      title: "홍익기술단 총무팀 방문협의 (청주)",
      tags: ["염"],
    },
    { time: "", title: "홍익기술단 감리부 방문협의", tags: ["권"] },
    {
      time: "",
      title: "회원관리시스템 flow작성(EG-BIM / KNGIL)",
      tags: ["김"],
    },
    { time: "", title: "대림대 계정 생성(100copy)", tags: ["김"] },
    {
      time: "",
      title: "드림플러스 주사용 명령어 각부서 조사 시트 정리",
      tags: ["김"],
    },
  ],
  "2025-11-20": [
    {
      time: "11:00~12:00",
      title:
        "삼안 CM현장 : 대전산업단지완충저류시설...( 대전 / 박준성 전무님) 대전광역시 대덕구 대화로 150번길 147-10",
      tags: ["권", "염"],
    },
    {
      time: "15:00~16:00",
      title:
        "삼안 CM현장 : 대청댐광역상수도노후관,,, ( 청주 / 노인호 부사장님)청주시 흥덕구 수의로 67",
      tags: ["권", "염"],
    },
    { time: "", title: "카이스트 방문", tags: ["권", "염"] },
    {
      time: "",
      title: "드림플러스 주사용 명령어 각부서 조사 시트 정리",
      tags: ["김"],
    },
    { time: "", title: "케이에스엠 계정 생성(10copy)", tags: ["김"] },
  ],
  "2025-11-21": [
    {
      time: "10:00~11:00",
      title: "실장님 영업보고 ( 팀 세미나)",
      tags: ["권", "염", "김"],
    },
    { time: "", title: "대림대 교육버전 납품목록 정리", tags: ["염"] },
    { time: "", title: "회원관리시스템 flow보완", tags: ["염"] },
    { time: "", title: "호건코리아 방문", tags: ["염"] },
    { time: "", title: "큰길 회원관리 시스템 flow 보완", tags: ["김"] },
    { time: "", title: "호건코리아 교육실 EG-BIM 설치", tags: ["김"] },
  ],
  "2025-11-24": [
    {
      time: "",
      title: "한라대학교 (강의커리큐럼 초안 작성)",
      tags: ["권", "염"],
    },
    {
      time: "",
      title: "브로슈어 우편물 발송 계획 (수도권, 선별 외)",
      tags: ["권", "김"],
    },
    { time: "", title: "교육기관 마케팅 보고서 작성", tags: ["염"] },
    {
      time: "",
      title: "교육기관 EG-BIM 라이선스 배포 현황 보고서 작성",
      tags: ["김"],
    },
    {
      time: "",
      title: "대림대학교 현물 기부금 처리 서류 작성",
      tags: ["권"],
    },
  ],
  "2025-11-25": [
    {
      time: "10:30~11:30",
      title:
        "10:30~11:30 삼안 CM현장 : 해안.방산(오미 ) 공공하수처리시설...신동훈 부사장님 (강원특별자치도 양구군 방산면 평화로5107번길 14)",
      tags: ["권", "염"],
    },
    {
      time: "13:00~14:00",
      title: "- 상지대, 지반공학회장 미팅",
      tags: ["권", "염"],
    },
  ],
  "2025-11-26": [
    {
      time: "10:30~11:30",
      title:
        "10:30~11:30 한국종합기술 ( 총괄본부장 - 김원식전무님, 복진훈수석님 동행 )",
      tags: ["권", "염"],
    },
    {
      time: "14:00~15:00",
      title: "삼안 대표이사님 면담삼안 CM현장 6개소 방문결과 보고 외",
      tags: ["권"],
    },
    {
      time: "16:00~17:00",
      title: "안양시청 방문, 마케팅 외",
      tags: ["권"],
    },
    {
      time: "16:00~17:00",
      title: "16:00~17:00 의왕도시공사 MOU체결",
      tags: ["염"],
    },
    { time: "", title: "삼안 (서울대 교육 지원 )", tags: ["염"] },
  ],
  "2025-11-27": [
    {
      time: "15:00~16:00",
      title:
        "사장님 영업보고, ( PM 활용 ) 교육기관, 가격정책, 기능개선, 단가프로그램 등",
      tags: ["권", "염", "김"],
    },
  ],
  "2025-12-03": [
    {
      time: "09:00~12:00",
      title: "이엔지소프트(오전)",
      tags: ["염"],
    },
    {
      time: "09:00~12:00",
      title: "담덕엔지니어링",
      tags: ["염"],
    },
    {
      time: "09:00~12:00",
      title: "서울대 최종평가",
      tags: ["염"],
    },
  ],
};
